In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('viz.csv')
df.head()

    Source      Target  Weight
0   Robert    Patricia       1
1     John    Jennifer       1
2  Michael       Linda       4
3    David   Elizabeth       5
4  William     Barbara       2

In [4]:
for idx, row in df.iterrows():
    w = row['Weight'] * 10
    df.at[idx, 'Weight'] = w

In [5]:
df.head()

    Source      Target  Weight
0   Robert    Patricia      10
1     John    Jennifer      10
2  Michael       Linda      40
3    David   Elizabeth      50
4  William     Barbara      20

In [27]:
df['Weight'] = df['Weight'].apply(lambda x: x*10)

0      1000
1      1000
2      4000
3      5000
4     10000
5      1000
6      2000
7      3000
8      1000
9      2000
10     1000
11     3000
12     1000
13     2000
14     2000
15     1000
16     1000
17     1000
Name: Weight, dtype: int64

In [ ]:
df.dropna(inplace=True)

In [7]:
df.head()

    Source      Target  Weight
0   Robert    Patricia     100
1     John    Jennifer     100
2  Michael       Linda     400
3    David   Elizabeth     500
4  William     Barbara     200

In [9]:
l = [1, 2, 3, 'x','y','z']
for i in range(0, len(l)):
    print(l[i])

1
2
3
x
y
z

In [10]:
for item in l:
    print(item)

1
2
3
x
y
z

DETERMINISTIC 
NONDETERMINISTIC

In [11]:
def add(n1, n2):
    return n1 + n2

In [12]:
add(7, 10)

17

In [13]:
add(7, 10)

17

In [14]:
df.head()

    Source      Target  Weight
0   Robert    Patricia     100
1     John    Jennifer     100
2  Michael       Linda     400
3    David   Elizabeth     500
4  William     Barbara     200

In [15]:
def add_df(df):
    result = 0
    for val in df['Weight']:
        result += val
    return result

In [17]:
df.at[4, 'Weight'] = 1000

In [18]:
add_df(df)

4200

In [19]:
add(2, 2)

4

In [20]:
bob = add

In [21]:
bob(2,2)

4

In [22]:
def somefunction(param):
    return param(2, 2)

In [23]:
somefunction(add)

4

In [24]:
temp = []
for i in range(10):
    temp.append(add)

In [26]:
for i in range(10):
    print(temp[i](i, i))

0
2
4
6
8
10
12
14
16
18

In [28]:
'a' in 'annoying'

True

In [29]:
l = ['bob','dmitriy','kate']
'bob' in l

True

In [32]:
def f(search, l):
    for item in l:
        if item == search:
            return True

In [30]:
df.head()

    Source      Target  Weight
0   Robert    Patricia     100
1     John    Jennifer     100
2  Michael       Linda     400
3    David   Elizabeth     500
4  William     Barbara    1000

In [31]:
df.query("Source == 'Robert'")

    Source     Target  Weight
0   Robert   Patricia     100
9   Robert   Jennifer     200
10  Robert      David     100
11  Robert      Susan     300

function = hello(){
    
}

function Hello(){

    // logic here
    
}

In [33]:
df.head()

    Source      Target  Weight
0   Robert    Patricia     100
1     John    Jennifer     100
2  Michael       Linda     400
3    David   Elizabeth     500
4  William     Barbara    1000

In [34]:
df.sort_values('Target', ascending=False)

        Source      Target  Weight
17   Elizabeth      Thomas     100
16   Elizabeth     Michael     100
10      Robert       David     100
14      Thomas     Charles     200
15   Elizabeth       Susan     100
5      Richard       Susan     100
13      Thomas       Susan     200
11      Robert       Susan     300
7       Thomas       Sarah     300
0       Robert    Patricia     100
2      Michael       Linda     400
8      Charles       Karen     100
12      Thomas     Jessica     100
6       Joseph     Jessica     200
1         John    Jennifer     100
9       Robert    Jennifer     200
3        David   Elizabeth     500
4      William     Barbara    1000

In [35]:
text = "Hello world"
sorted(text)

[' ', 'H', 'd', 'e', 'l', 'l', 'l', 'o', 'o', 'r', 'w']

* user_id
* first_name
* last_name
* ssn
* dob

In [48]:
u = {
   "user_id" : "1",
    "first_name" : "Dmitriy",
    "last_name" : "Babichenko",
    "ssn" : "111-11-1111",
    "dob" : "04-11-1977"
}

In [49]:
u_list = []
for i in range(100):
    u_list.append(u)

In [50]:
u_list[5]['user_id']

'1'

In [53]:
def bob(x):
    return x*5

In [54]:


text = "Hello"
text[0]

'H'

In [57]:
text[1:3]

'el'

In [59]:
text[0] = 'X'

TypeError: 'str' object does not support item assignment

In [9]:
import pandas as pd
from functools import reduce

In [10]:
df = pd.read_csv("diabetes.csv")
df.head()

,id,chol,stab.glu,hdl,ratio,glyhb,location,age,gender,height,weight,frame,bp.1s,bp.1d,waist,hip
0,1000,203.0,82,56.0,3.6,4.31,Buckingham,46,female,62.0,121.0,medium,118.0,59.0,29.0,38.0
1,1001,165.0,97,24.0,6.9,4.44,Buckingham,29,female,64.0,218.0,large,112.0,68.0,46.0,48.0
2,1002,228.0,92,37.0,6.2,4.64,Buckingham,58,female,61.0,256.0,large,190.0,92.0,49.0,57.0
3,1003,78.0,93,12.0,6.5,4.63,Buckingham,67,male,67.0,119.0,large,110.0,50.0,33.0,38.0
4,1005,249.0,90,28.0,8.9,7.72,Buckingham,64,male,68.0,183.0,medium,138.0,80.0,44.0,41.0

In [11]:
df.isnull()

,id,chol,stab.glu,hdl,ratio,glyhb,location,age,gender,height,weight,frame,bp.1s,bp.1d,waist,hip
0,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
398,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
399,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
400,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
401,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
402,False,False,False,False,False,True,False,False,False,False,False,False,False,False,False,False

In [12]:
def both_true(a, b):
    return bool(a and b)

In [13]:
df['chol'].isnull().sum()

1

In [16]:
reduce(both_true, df['glyhb'].isnull())

False